# Elements Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSystem..::..Elements Property
MEPSystem Class See Also
---
Terminal elements in the system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementSet Elements { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Elements As ElementSet
	Get
```

Visual C++
---
```text
public:
property ElementSet^ Elements {
	ElementSet^ get ();
}
```

# Remarks
The return value is a read only collection and doesn't include the base equipment or panel.
# See Also
MEPSystem Class
Autodesk.Revit.DB Namespace